package com.example.project;

import android.os.Bundle;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import java.util.ArrayList;
import java.util.List;

public class Main3Activity extends AppCompatActivity {

    RecyclerView NewsrecyclerView2;

    NewsAdapter2 newsAdapter2;
    List<NewsItem2>mData2;
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main3);


        NewsrecyclerView2=findViewById(R.id.news_rv2);
        mData2=new ArrayList<>();

        mData2.add(new NewsItem2("عودة ميسي = عودة برشلونة للحياة","عودة لطالما انتظرتها جماهير برشلونة وهي قدوم النجم الأرجنتيني وأسطورة الفريق ليونيل ميسي إلى تشكيلة برشلونة الأساسية، حيث بدون النجم الأرجنتيني ، وجد عمالقة الدوري الإسباني أنفسهم في المركز السابع بعدما حققوا نسبة فوز بلغت 40 في المائة وجمعوا 1.4 كمعدل نقاط في كل مباراة","12/12/2019",R.drawable.images));
        mData2.add(new NewsItem2("عودة ميسي = عودة برشلونة للحياة","عودة لطالما انتظرتها جماهير برشلونة وهي قدوم النجم الأرجنتيني وأسطورة الفريق ليونيل ميسي إلى تشكيلة برشلونة الأساسية، حيث بدون النجم الأرجنتيني ، وجد عمالقة الدوري الإسباني أنفسهم في المركز السابع بعدما حققوا نسبة فوز بلغت 40 في المائة وجمعوا 1.4 كمعدل نقاط في كل مباراة","12/12/2019",R.drawable.images));
        mData2.add(new NewsItem2("عودة ميسي = عودة برشلونة للحياة","عودة لطالما انتظرتها جماهير برشلونة وهي قدوم النجم الأرجنتيني وأسطورة الفريق ليونيل ميسي إلى تشكيلة برشلونة الأساسية، حيث بدون النجم الأرجنتيني ، وجد عمالقة الدوري الإسباني أنفسهم في المركز السابع بعدما حققوا نسبة فوز بلغت 40 في المائة وجمعوا 1.4 كمعدل نقاط في كل مباراة","12/12/2019",R.drawable.images));
        mData2.add(new NewsItem2("عودة ميسي = عودة برشلونة للحياة","عودة لطالما انتظرتها جماهير برشلونة وهي قدوم النجم الأرجنتيني وأسطورة الفريق ليونيل ميسي إلى تشكيلة برشلونة الأساسية، حيث بدون النجم الأرجنتيني ، وجد عمالقة الدوري الإسباني أنفسهم في المركز السابع بعدما حققوا نسبة فوز بلغت 40 في المائة وجمعوا 1.4 كمعدل نقاط في كل مباراة","12/12/2019",R.drawable.images));
        mData2.add(new NewsItem2("عودة ميسي = عودة برشلونة للحياة","عودة لطالما انتظرتها جماهير برشلونة وهي قدوم النجم الأرجنتيني وأسطورة الفريق ليونيل ميسي إلى تشكيلة برشلونة الأساسية، حيث بدون النجم الأرجنتيني ، وجد عمالقة الدوري الإسباني أنفسهم في المركز السابع بعدما حققوا نسبة فوز بلغت 40 في المائة وجمعوا 1.4 كمعدل نقاط في كل مباراة","12/12/2019",R.drawable.images));
        mData2.add(new NewsItem2("عودة ميسي = عودة برشلونة للحياة","عودة لطالما انتظرتها جماهير برشلونة وهي قدوم النجم الأرجنتيني وأسطورة الفريق ليونيل ميسي إلى تشكيلة برشلونة الأساسية، حيث بدون النجم الأرجنتيني ، وجد عمالقة الدوري الإسباني أنفسهم في المركز السابع بعدما حققوا نسبة فوز بلغت 40 في المائة وجمعوا 1.4 كمعدل نقاط في كل مباراة","12/12/2019",R.drawable.images));
        mData2.add(new NewsItem2("عودة ميسي = عودة برشلونة للحياة","عودة لطالما انتظرتها جماهير برشلونة وهي قدوم النجم الأرجنتيني وأسطورة الفريق ليونيل ميسي إلى تشكيلة برشلونة الأساسية، حيث بدون النجم الأرجنتيني ، وجد عمالقة الدوري الإسباني أنفسهم في المركز السابع بعدما حققوا نسبة فوز بلغت 40 في المائة وجمعوا 1.4 كمعدل نقاط في كل مباراة","12/12/2019",R.drawable.images));
        mData2.add(new NewsItem2("عودة ميسي = عودة برشلونة للحياة","عودة لطالما انتظرتها جماهير برشلونة وهي قدوم النجم الأرجنتيني وأسطورة الفريق ليونيل ميسي إلى تشكيلة برشلونة الأساسية، حيث بدون النجم الأرجنتيني ، وجد عمالقة الدوري الإسباني أنفسهم في المركز السابع بعدما حققوا نسبة فوز بلغت 40 في المائة وجمعوا 1.4 كمعدل نقاط في كل مباراة","12/12/2019",R.drawable.images));
        mData2.add(new NewsItem2("عودة ميسي = عودة برشلونة للحياة","عودة لطالما انتظرتها جماهير برشلونة وهي قدوم النجم الأرجنتيني وأسطورة الفريق ليونيل ميسي إلى تشكيلة برشلونة الأساسية، حيث بدون النجم الأرجنتيني ، وجد عمالقة الدوري الإسباني أنفسهم في المركز السابع بعدما حققوا نسبة فوز بلغت 40 في المائة وجمعوا 1.4 كمعدل نقاط في كل مباراة","12/12/2019",R.drawable.images));
        mData2.add(new NewsItem2("عودة ميسي = عودة برشلونة للحياة","عودة لطالما انتظرتها جماهير برشلونة وهي قدوم النجم الأرجنتيني وأسطورة الفريق ليونيل ميسي إلى تشكيلة برشلونة الأساسية، حيث بدون النجم الأرجنتيني ، وجد عمالقة الدوري الإسباني أنفسهم في المركز السابع بعدما حققوا نسبة فوز بلغت 40 في المائة وجمعوا 1.4 كمعدل نقاط في كل مباراة","12/12/2019",R.drawable.images));
        mData2.add(new NewsItem2("عودة ميسي = عودة برشلونة للحياة","عودة لطالما انتظرتها جماهير برشلونة وهي قدوم النجم الأرجنتيني وأسطورة الفريق ليونيل ميسي إلى تشكيلة برشلونة الأساسية، حيث بدون النجم الأرجنتيني ، وجد عمالقة الدوري الإسباني أنفسهم في المركز السابع بعدما حققوا نسبة فوز بلغت 40 في المائة وجمعوا 1.4 كمعدل نقاط في كل مباراة","12/12/2019",R.drawable.images));
        mData2.add(new NewsItem2("عودة ميسي = عودة برشلونة للحياة","عودة لطالما انتظرتها جماهير برشلونة وهي قدوم النجم الأرجنتيني وأسطورة الفريق ليونيل ميسي إلى تشكيلة برشلونة الأساسية، حيث بدون النجم الأرجنتيني ، وجد عمالقة الدوري الإسباني أنفسهم في المركز السابع بعدما حققوا نسبة فوز بلغت 40 في المائة وجمعوا 1.4 كمعدل نقاط في كل مباراة","12/12/2019",R.drawable.images));

        mData2.add(new NewsItem2("عودة ميسي = عودة برشلونة للحياة","عودة لطالما انتظرتها جماهير برشلونة وهي قدوم النجم الأرجنتيني وأسطورة الفريق ليونيل ميسي إلى تشكيلة برشلونة الأساسية، حيث بدون النجم الأرجنتيني ، وجد عمالقة الدوري الإسباني أنفسهم في المركز السابع بعدما حققوا نسبة فوز بلغت 40 في المائة وجمعوا 1.4 كمعدل نقاط في كل مباراة","12/12/2019",R.drawable.images));

        newsAdapter2=new NewsAdapter2(this,mData2);
        NewsrecyclerView2.setAdapter(newsAdapter2);
        NewsrecyclerView2.setLayoutManager(new LinearLayoutManager(this));
    }
}
